artillery.yaml
config:
  target: "http://54.219.188.226:80"
  http:
    pool: 200
    maxSockets: 5
    timeout: 59
  phases:
    - duration: 200
      arrivalCount: 1000
      maxVusers: 20000
      name: 200 seconds, 20,000 max users

scenarios:
  - name: "1000 gets per user"
    flow:
      - loop:
        - get:
          url: "/{ $loopCount + 9998000 }/"
          url: "/{ $loopCount + 9998000 }/reviews"
          url: "/{ $loopCount + 9998000 }/averageReviewsRating"
          count: 1000